<a href="https://colab.research.google.com/github/apraveen005/machine_learning_with_python/blob/master/Lecture09_Oct17.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
medal_types=['gold_top5.csv','silver_top5.csv','bronze_top5.csv']

In [ ]:
medals=[]
for csvname in medal_types:
  medal_df=pd.read_csv(csvname,index_col='Country')
  medals.append(medal_df)
medals=pd.concat(medals,keys=['Gold','Silver','Bronze'])

In [ ]:
medals_sorted=medals.sort_index(level=0)

In [ ]:
medals_sorted.loc[('Bronze','Germany')]

Total    454.0
Name: (Bronze, Germany), dtype: float64

In [ ]:
medals_sorted.loc['Silver']

                 Total
Country
France           461.0
Italy            394.0
Soviet Union     627.0
United Kingdom   591.0
United States   1195.0

In [ ]:
medals

                        Total
       Country
Gold   Germany          407.0
       Italy            460.0
       Soviet Union     838.0
       United Kingdom   498.0
       United States   2088.0
Silver France           461.0
       Italy            394.0
       Soviet Union     627.0
       United Kingdom   591.0
       United States   1195.0
Bronze France           475.0
       Germany          454.0
       Soviet Union     584.0
       United Kingdom   505.0
       United States   1052.0

In [ ]:
medals=[]
for csvname in medal_types:
  medal_df=pd.read_csv(csvname,index_col='Country')
  medals.append(medal_df)

In [ ]:
medals

[                 Total
 Country
 Germany          407.0
 Italy            460.0
 Soviet Union     838.0
 United Kingdom   498.0
 United States   2088.0,                  Total
 Country
 France           461.0
 Italy            394.0
 Soviet Union     627.0
 United Kingdom   591.0
 United States   1195.0,                  Total
 Country
 France           475.0
 Germany          454.0
 Soviet Union     584.0
 United Kingdom   505.0
 United States   1052.0]

In [ ]:
pd.concat(medals,axis=1,join='outer')

                 Total   Total   Total
Germany          407.0     NaN   454.0
Italy            460.0   394.0     NaN
Soviet Union     838.0   627.0   584.0
United Kingdom   498.0   591.0   505.0
United States   2088.0  1195.0  1052.0
France             NaN   461.0   475.0

In [ ]:
pd.concat(medals,axis=1,join='inner')

                 Total   Total   Total
Country
Soviet Union     838.0   627.0   584.0
United Kingdom   498.0   591.0   505.0
United States   2088.0  1195.0  1052.0